In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df=pd.read_csv('Social_Network_Ads.csv')

In [3]:
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [5]:
df.drop(['User ID'],axis=1,inplace=True)

In [6]:
df.head()

   Gender  Age  EstimatedSalary  Purchased
0    Male   19            19000          0
1    Male   35            20000          0
2  Female   26            43000          0
3  Female   27            57000          0
4    Male   19            76000          0

In [8]:
Sex=pd.get_dummies(df['Gender'],drop_first=True)

In [11]:
df=pd.concat([df,Sex],axis=1)

In [12]:
df.head()

   Gender  Age  EstimatedSalary  Purchased  Male
0    Male   19            19000          0     1
1    Male   35            20000          0     1
2  Female   26            43000          0     0
3  Female   27            57000          0     0
4    Male   19            76000          0     1

In [24]:
df.drop(['Gender'],axis=1,inplace=True)

In [14]:
from sklearn.model_selection import train_test_split

In [38]:
y=df['Purchased']

In [39]:
y.head()

0    0
1    0
2    0
3    0
4    0
Name: Purchased, dtype: int64

In [26]:
X=df.drop(['Purchased'],axis=1)

In [27]:
X.head()

   Age  EstimatedSalary  Male
0   19            19000     1
1   35            20000     1
2   26            43000     0
3   27            57000     0
4   19            76000     1

In [30]:
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.3,random_state=0)

In [31]:
from sklearn.linear_model import LogisticRegression

In [32]:
Reg=LogisticRegression()

In [33]:
Reg.fit(X_train,y_train)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [34]:
Reg.predict(X_test)

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0], dtype=int64)

In [35]:
from sklearn.metrics import accuracy_score

In [36]:
score=accuracy_score(Reg.predict(X_test),y_test)

In [37]:
print(score)

0.6583333333333333